Autodesk.Revit.DB.Structure.IMemberForcesServer.MemberForcesUpdate(Autodesk.Revit.DB.Structure.MemberForcesServiceData)
The server's method that will be called when Revit User clicks Member Forces button in the MPP.
Remarks:
The server provides UI way for Revit user to view and modify the detail data corresponding with the parameter value.
The server may also modify the section type parameter value itself during the execution.
The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything.
Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
data:
The Moment Forces data.
Returns:
Indicates whether themember forces parameter server is executed successfully.
Since:
2015

Autodesk.Revit.DB.Structure.IMemberForcesServer
Interface for the Member Forces server to implement.
Since:
2015